#ifndef CONFIG_H
#define CONFIG_H

/******************************************************************************
 * @brief 版本信息
 ******************************************************************************/
//软件的版
//主版本
 #define MAIN_VERSION 1
//NFC版本

//EEPROM



/******************************************************************************
 * @brief 恒功率的限定范围
 ******************************************************************************/
// 通道1目标功率范围设定
#define TARGET_POWER_CHANNEL1_MAX 1350  // 通道1最大目标功率限制（单位：瓦特 W）
#define TARGET_POWER_CHANNEL1_MIN 600   // 通道1最小目标功率限制（单位：瓦特 W）                            
// 典型应用：600W~1350W的功率调节范围

// 通道2目标功率范围设定  
#define TARGET_POWER_CHANNEL2_MAX 150   // 通道2最大目标功率限制（单位：瓦特 W）
#define TARGET_POWER_CHANNEL2_MIN 60    // 通道2最小目标功率限制（单位：瓦特 W）                                    
// 典型应用：60W~150W的功率调节范围

/******************************************************************************
 * @brief 输出电流采集电阻
 ******************************************************************************/
#define CURRENT_CH1_R1  730.0f  // 通道1电流采样电路的第一级分压电阻值（单位：欧姆）
#define CURRENT_CH1_R2  8880.0f // 通道1电流采样电路的第二级分压电阻值（单位：欧姆）

#define CURRENT_CH2_R1  730.0f  // 通道2电流采样电路的第一级分压电阻值（单位：欧姆）
#define CURRENT_CH2_R2  10680.0f // 通道2电流采样电路的第二级分压电阻值（单位：欧姆）


/*******************************************************************************
 * @brief 输入保护功能
 * @Function：
 * 1. 小于280V灭灯
 * 2. 【280,310】：开灯但是降一半功率
 * 3. 310以上恢复功率
 * 实际测量：   280V灯亮时候  ADC采集值区间 【1683,1740】            
 *             280灯不亮时候  ADC采集值区间 【1931,1986】
 *             310V灯亮时候   ADC采集值区间 【1871,1935】
 * @note    应在系统启动时调用一次，之后在PID执行过程中调用，确保迅速反应
 * @warning 调用前需确保相关硬件（如ADC、传感器）已上电稳定
 ******************************************************************************/
#define POWER_OFF_THRESHOLD          1700     // 280V  输入电压关灯下限
#define POWER_ON_THRESHOLD           1650     // 260V  输入最低电压下限（开机条件）
#define POWER_DOWN_THRESHOLD1        1750  
#define POWER_DOWN_THRESHOLD2        1850     // 295V  输入电压降功率阈值
#define POWER_RESTORE_THRESHOLD      2100     // 310V  输入电压功率恢复阈值


/******************************************************************************
 * @brief 输出电压采集电阻
 ******************************************************************************/
#define VOLTAGE_CH1_R1 1087.5f // 通道1电压采样分压电路的高侧电阻值（单位：欧姆）
#define VOLTAGE_CH1_R2 7.5f    // 通道1电压采样分压电路的低侧电阻值（单位：欧姆）

#define VOLTAGE_CH2_R1 1087.5f // 通道2电压采样分压电路的高侧电阻值（单位：欧姆）
#define VOLTAGE_CH2_R2 7.5f    // 通道2电压采样分压电路的低侧电阻值（单位：欧姆）


/******************************************************************************
 * @brief 输出开路和过功率保护阈值
 ******************************************************************************/

#define OVER_VOLTAGE_CHANNEL1   550 //通道1过压保护阈值 电压超过550V触发保护
#define UNDER_VOLTAGE_CHANNEL1  150 //通道1欠压保护阈值 电压低于150V触发保护
#define SHORT_CIRCUIT_CHANNEL1  30  //通道1短路保护阈值 电压低于30V触发短路保护
#define OVER_POWER_CHANNEL1(x) ((float)(x) * 1.10f) //通道1过功率保护阈值的%10

#define OVER_VOLTAGE_CHANNEL2   300  //通道2过压保护阈值 电压超过300V触发保护
#define UNDER_VOLTAGE_CHANNEL2  50  //通道2欠压保护阈值 电压低于50V触发保护
#define SHORT_CIRCUIT_CHANNEL2  20  //通道2短路保护阈值 电压低于20V触发短路保护
#define OVER_POWER_CHANNEL2(x) ((float)(x) * 1.10f)//通道2过功率保护阈值的%10


#define OVER_UNDER_VOLTAGE_PROTECTION_TIME 1000   //过欠压保护时间宏定义 ms
#define SHORT_CIRCUIT_PROTECTION_TIME      200   //短路保护时间宏定义 ms
#define PROTECTION_RESTORE_TIME            5000   //保护次数恢复时间宏定义 ms
/******************************************************************************
 * @brief 温度保护保护阈值
 ******************************************************************************/

#define TEMP_PROTECTION_RESTORE      70.0f        //温度保护恢复值宏定义


/******************************************************************************
 * @brief 调试配置
 ******************************************************************************/
#define ENABLE_DEBUG_DISPLAY 1

#endif 